<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"51f4ffb264449d7959654776cc7fc46db9dcc6e412bc7557ea7ed3c9be189ac7","plan_job_ref":"Job Terraform Plan #340 at https://github.com/cal-itp/data-infra/actions/runs/16013497864","plan_out_hash":"4cb8c4417f1f00cd184fd7c85ac80dd378da20422b917c342a91f7bbae53a0eb","plan_hash":"a3fed687cdfc5020e7a4afc7ab0215a2ddce5928ea92fc41620e94c9688eb13a","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/composer/us__
<details>
<summary>Plan: 6 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_composer_environment.calitp-composer will be created
+   resource "google_composer_environment" "calitp-composer" {
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       name             = "calitp-composer"
+       project          = "cal-itp-data-infra"
+       region           = "us-west2"
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       config {
+           airflow_uri                = (known after apply)
+           dag_gcs_prefix             = (known after apply)
+           enable_private_builds_only = (known after apply)
+           enable_private_environment = (known after apply)
+           environment_size           = "ENVIRONMENT_SIZE_SMALL"
+           gke_cluster                = (known after apply)
+           node_count                 = (known after apply)
+           resilience_mode            = (known after apply)

+           data_retention_config (known after apply)

+           database_config (known after apply)

+           encryption_config (known after apply)

+           maintenance_window (known after apply)

+           node_config {
+               composer_internal_ipv4_cidr_block = (known after apply)
+               composer_network_attachment       = (known after apply)
+               disk_size_gb                      = (known after apply)
+               enable_ip_masq_agent              = (known after apply)
+               machine_type                      = (known after apply)
+               network                           = (known after apply)
+               oauth_scopes                      = (known after apply)
+               service_account                   = "projects/cal-itp-data-infra/serviceAccounts/composer-service-account@cal-itp-data-infra.iam.gserviceaccount.com"
+               subnetwork                        = (known after apply)
+               zone                              = (known after apply)

+               ip_allocation_policy (known after apply)
            }

+           private_environment_config (known after apply)

+           software_config {
+               airflow_config_overrides = {
+                   "celery-worker_concurrency"                  = "1"
+                   "core-dag_file_processor_timeout"            = "1200"
+                   "core-dagbag_import_timeout"                 = "600"
+                   "core-dags_are_paused_at_creation"           = "True"
+                   "scheduler-min_file_process_interval"        = "120"
+                   "scheduler-scheduler_health_check_threshold" = "120"
+                   "secrets-backend"                            = "*******************************************************************************"
+                   "webserver-reload_on_plugin_change"          = "True"
                }
+               env_variables            = {
+                   "AIRFLOW_CONN_GOOGLE_CLOUD_DEFAULT"                    = "'google-cloud-platform://'"
+                   "AIRFLOW_ENV"                                          = "cal-itp-data-infra"
+                   "AIRFLOW_VAR_EXTRACT_BUCKET"                           = "gs://gtfs-data"
+                   "CALITP_AUTH"                                          = "cloud"
+                   "CALITP_BQ_LOCATION"                                   = "us-west2"
+                   "CALITP_BQ_MAX_BYTES"                                  = "50000000000"
+                   "CALITP_BUCKET__AGGREGATOR_SCRAPER"                    = "gs://calitp-aggregator-scraper"
+                   "CALITP_BUCKET__AIRTABLE"                              = "gs://calitp-airtable"
+                   "CALITP_BUCKET__AMPLITUDE_BENEFITS_EVENTS"             = "gs://calitp-amplitude-benefits-events"
+                   "CALITP_BUCKET__ANALYSIS_OUTPUT_MODELS"                = "gs://analysis-output-models"
+                   "CALITP_BUCKET__DBT_ARTIFACTS"                         = "gs://calitp-dbt-artifacts"
+                   "CALITP_BUCKET__DBT_DOCS"                              = "gs://calitp-dbt-docs"
+                   "CALITP_BUCKET__ELAVON_PARSED"                         = "gs://calitp-elavon-parsed"
+                   "CALITP_BUCKET__ELAVON_RAW"                            = "gs://calitp-elavon-raw"
+                   "CALITP_BUCKET__GTFS_DOWNLOAD_CONFIG"                  = "gs://calitp-gtfs-download-config"
+                   "CALITP_BUCKET__GTFS_DOWNLOAD_CONFIG_PROD_SOURCE"      = "gs://calitp-gtfs-download-config"
+                   "CALITP_BUCKET__GTFS_DOWNLOAD_CONFIG_TEST_DESTINATION" = "gs://test-calitp-gtfs-download-config"
+                   "CALITP_BUCKET__GTFS_RT_PARSED"                        = "gs://calitp-gtfs-rt-parsed"
+                   "CALITP_BUCKET__GTFS_RT_RAW"                           = "gs://calitp-gtfs-rt-raw-v2"
+                   "CALITP_BUCKET__GTFS_RT_VALIDATION"                    = "gs://calitp-gtfs-rt-validation"
+                   "CALITP_BUCKET__GTFS_SCHEDULE_PARSED"                  = "gs://calitp-gtfs-schedule-parsed"
+                   "CALITP_BUCKET__GTFS_SCHEDULE_PARSED_HOURLY"           = "gs://calitp-gtfs-schedule-parsed-hourly"
+                   "CALITP_BUCKET__GTFS_SCHEDULE_RAW"                     = "gs://calitp-gtfs-schedule-raw-v2"
+                   "CALITP_BUCKET__GTFS_SCHEDULE_UNZIPPED"                = "gs://calitp-gtfs-schedule-unzipped"
+                   "CALITP_BUCKET__GTFS_SCHEDULE_UNZIPPED_HOURLY"         = "gs://calitp-gtfs-schedule-unzipped-hourly"
+                   "CALITP_BUCKET__GTFS_SCHEDULE_VALIDATION"              = "gs://calitp-gtfs-schedule-validation"
+                   "CALITP_BUCKET__GTFS_SCHEDULE_VALIDATION_HOURLY"       = "gs://calitp-gtfs-schedule-validation-hourly"
+                   "CALITP_BUCKET__LITTLEPAY_PARSED"                      = "gs://calitp-payments-littlepay-parsed"
+                   "CALITP_BUCKET__LITTLEPAY_PARSED_V3"                   = "gs://calitp-payments-littlepay-parsed-v3"
+                   "CALITP_BUCKET__LITTLEPAY_RAW"                         = "gs://calitp-payments-littlepay-raw"
+                   "CALITP_BUCKET__LITTLEPAY_RAW_V3"                      = "gs://calitp-payments-littlepay-raw-v3"
+                   "CALITP_BUCKET__NTD_API_DATA_PRODUCTS"                 = "gs://calitp-ntd-api-products"
+                   "CALITP_BUCKET__NTD_REPORT_VALIDATION"                 = "gs://calitp-ntd-report-validation"
+                   "CALITP_BUCKET__NTD_XLSX_DATA_PRODUCTS__CLEAN"         = "gs://calitp-ntd-xlsx-products-clean"
+                   "CALITP_BUCKET__NTD_XLSX_DATA_PRODUCTS__RAW"           = "gs://calitp-ntd-xlsx-products-raw"
+                   "CALITP_BUCKET__PUBLISH"                               = "gs://calitp-publish"
+                   "CALITP_BUCKET__SENTRY_EVENTS"                         = "gs://test-calitp-sentry"
+                   "CALITP_BUCKET__STATE_GEOPORTAL_DATA_PRODUCTS"         = "gs://calitp-state-geoportal-scrape"
+                   "CALITP_USER"                                          = "pipeline"
+                   "CALITP__ELAVON_SFTP_HOSTNAME"                         = "34.145.56.125"
+                   "CALITP__ELAVON_SFTP_PORT"                             = "2200"
+                   "CALITP__ELAVON_SFTP_USERNAME"                         = "elavon"
+                   "DBT_TARGET"                                           = "prod"
+                   "GOOGLE_CLOUD_PROJECT"                                 = "cal-itp-data-infra"
+                   "POD_CLUSTER_NAME"                                     = "airflow-jobs"
+                   "POD_LOCATION"                                         = "us-west2"
+                   "POD_SECRETS_NAMESPACE"                                = "************"
+                   "SENTRY_DSN"                                           = "https://0fc56e5e8a96482da63b8d9dd3955ee7@sentry.k8s.calitp.jarv.us/2"
+                   "SENTRY_ENVIRONMENT"                                   = "cal-itp-data-infra"
+                   "SERVICE_ACCOUNT_NAME"                                 = "composer-service-account@cal-itp-data-infra.iam.gserviceaccount.com"
                }
+               image_version            = "composer-2.8.3-airflow-2.6.3"
+               pypi_packages            = {
+                   "astronomer-cosmos" = null
+                   "beautifulsoup4"    = "==4.12.3"
+                   "boto3"             = ">=1.26.87,<2"
+                   "calitp-data-infra" = "==2025.6.5"
+                   "gusty"             = "==0.6.0"
+                   "openpyxl"          = "==3.1.5"
+                   "platformdirs"      = ">=2.5"
+                   "pyairtable"        = "==2.2.1"
+                   "pydantic"          = ">=1.9,<2.0"
+                   "sentry-sdk"        = "==1.17.0"
+                   "typer"             = "==0.4.1"
                }
+               python_version           = (known after apply)
+               scheduler_count          = (known after apply)
+               web_server_plugins_mode  = (known after apply)

+               cloud_data_lineage_integration (known after apply)
            }

+           web_server_config (known after apply)

+           web_server_network_access_control (known after apply)

+           workloads_config {
+               dag_processor (known after apply)
+               scheduler {
+                   count      = 1
+                   cpu        = 1
+                   memory_gb  = 1
+                   storage_gb = 1
                }
+               triggerer (known after apply)
+               web_server {
+                   cpu        = 1
+                   memory_gb  = 2
+                   storage_gb = 1
                }
+               worker {
+                   cpu        = 2
+                   max_count  = 2
+                   memory_gb  = 2
+                   min_count  = 1
+                   storage_gb = 1
                }
            }
        }

+       storage_config {
+           bucket = "calitp-composer"
        }
    }

  # google_service_account_key.composer will be created
+   resource "google_service_account_key" "composer" {
+       id                 = (known after apply)
+       key_algorithm      = "KEY_ALG_RSA_2048"
+       name               = (known after apply)
+       private_key        = (sensitive value)
+       private_key_type   = "****************************"
+       public_key         = (known after apply)
+       public_key_type    = "******************"
+       service_account_id = "***************************************************************************************************************"
+       valid_after        = (known after apply)
+       valid_before       = (known after apply)
    }

  # kubernetes_namespace.composer will be created
+   resource "kubernetes_namespace" "composer" {
+       id                               = (known after apply)
+       wait_for_default_service_account = false

+       metadata {
+           annotations      = {
+               "name" = "airflow-jobs-namespace"
            }
+           generation       = (known after apply)
+           labels           = {
+               "namespace" = "airflow-jobs"
            }
+           name             = "airflow-jobs"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_priority_class.dbt-high-priority will be created
+   resource "kubernetes_priority_class" "dbt-high-priority" {
+       description       = "This priority class should be used for dbt pods only."
+       global_default    = false
+       id                = (known after apply)
+       preemption_policy = "PreemptLowerPriority"
+       value             = 1000000

+       metadata {
+           generation       = (known after apply)
+           name             = "dbt-high-priority"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.composer will be created
+   resource "kubernetes_secret" "composer" {
+       binary_data_wo                 = (write-only attribute)
+       data                           = (sensitive value)
+       data_wo                        = (write-only attribute)
+       id                             = (known after apply)
+       type                           = "Opaque"
+       wait_for_service_account_token = true

+       metadata {
+           generation       = (known after apply)
+           name             = "jobs-data"
+           namespace        = "airflow-jobs"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_service_account.composer-service-account will be created
+   resource "kubernetes_service_account" "composer-service-account" {
+       automount_service_account_token = true
+       default_secret_name             = (known after apply)
+       id                              = (known after apply)

+       metadata {
+           annotations      = {
+               "iam.gke.io/gcp-service-account" = "composer-service-account@cal-itp-data-infra.iam.gserviceaccount.com"
            }
+           generation       = (known after apply)
+           name             = "composer-service-account"
+           namespace        = "airflow-jobs"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #340](https://github.com/cal-itp/data-infra/actions/runs/16013497864)